# <center> Pandas 02 <center>

<img src = 'https://github.com/saeed-saffari/alzahra-workshop-spr2021/blob/main/lecture/PIC/Pandas.png?raw=true' 
     width = "550"
     >

## Imports

In [1]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

## Na, NAN

In [2]:
df = pd.DataFrame({
    'col1':[1,2,3,4,np.nan],
    'col2':[np.nan,555,np.nan,444, 333],
    'col3':['abc', 'def', 'ghi', 'xyz', 'ghj'],
    'col4':['16', '23', '18', '25', '27'],
    'col5':['187', '160', np.nan, '202', '163']
})
df

   col1   col2 col3 col4 col5
0   1.0    NaN  abc   16  187
1   2.0  555.0  def   23  160
2   3.0    NaN  ghi   18  NaN
3   4.0  444.0  xyz   25  202
4   NaN  333.0  ghj   27  163

In [3]:
df.isnull()

    col1   col2   col3   col4   col5
0  False   True  False  False  False
1  False  False  False  False  False
2  False   True  False  False   True
3  False  False  False  False  False
4   True  False  False  False  False

In [4]:
df.dropna()

   col1   col2 col3 col4 col5
1   2.0  555.0  def   23  160
3   4.0  444.0  xyz   25  202

In [5]:
df

   col1   col2 col3 col4 col5
0   1.0    NaN  abc   16  187
1   2.0  555.0  def   23  160
2   3.0    NaN  ghi   18  NaN
3   4.0  444.0  xyz   25  202
4   NaN  333.0  ghj   27  163

In [6]:
df.fillna(120)

    col1   col2 col3 col4 col5
0    1.0  120.0  abc   16  187
1    2.0  555.0  def   23  160
2    3.0  120.0  ghi   18  120
3    4.0  444.0  xyz   25  202
4  120.0  333.0  ghj   27  163

In [7]:
df.fillna('missing')

      col1     col2 col3 col4     col5
0      1.0  missing  abc   16      187
1      2.0    555.0  def   23      160
2      3.0  missing  ghi   18  missing
3      4.0    444.0  xyz   25      202
4  missing    333.0  ghj   27      163

In [11]:
df.fillna(method= 'ffill')

   col1   col2 col3 col4 col5
0   1.0    NaN  abc   16  187
1   2.0  555.0  def   23  160
2   3.0  555.0  ghi   18  160
3   4.0  444.0  xyz   25  202
4   4.0  333.0  ghj   27  163

In [10]:
df.fillna(method= 'ffill').dropna()

   col1   col2 col3 col4 col5
1   2.0  555.0  def   23  160
2   3.0  555.0  ghi   18  160
3   4.0  444.0  xyz   25  202
4   4.0  333.0  ghj   27  163

In [12]:
df.fillna(method= 'bfill')

   col1   col2 col3 col4 col5
0   1.0  555.0  abc   16  187
1   2.0  555.0  def   23  160
2   3.0  444.0  ghi   18  202
3   4.0  444.0  xyz   25  202
4   NaN  333.0  ghj   27  163

In [13]:
df.interpolate()

   col1   col2 col3 col4 col5
0   1.0    NaN  abc   16  187
1   2.0  555.0  def   23  160
2   3.0  499.5  ghi   18  NaN
3   4.0  444.0  xyz   25  202
4   4.0  333.0  ghj   27  163

In [18]:
df[['col4', 'col5']] = df[['col4', 'col5']].astype(float)

In [19]:
df

   col1   col2 col3  col4   col5
0   1.0    NaN  abc  16.0  187.0
1   2.0  555.0  def  23.0  160.0
2   3.0    NaN  ghi  18.0    NaN
3   4.0  444.0  xyz  25.0  202.0
4   NaN  333.0  ghj  27.0  163.0

In [20]:
df.interpolate()

   col1   col2 col3  col4   col5
0   1.0    NaN  abc  16.0  187.0
1   2.0  555.0  def  23.0  160.0
2   3.0  499.5  ghi  18.0  181.0
3   4.0  444.0  xyz  25.0  202.0
4   4.0  333.0  ghj  27.0  163.0

## Concat

In [21]:
df1 = pd.DataFrame({
    'A': ['A0', 'A1', 'A2', 'A3'],
    'B': ['B0', 'B1', 'B2', 'B3'],
    'C': ['C0', 'C1', 'C2', 'C3'],
    'D': ['D0', 'D1', 'D2', 'D3']},
    index=[0, 1, 2, 3])

df2 = pd.DataFrame({
    'A': ['A4', 'A5', 'A6', 'A7'],
    'B': ['B4', 'B5', 'B6', 'B7'],
    'C': ['C4', 'C5', 'C6', 'C7'],
    'D': ['D4', 'D5', 'D6', 'D7']},
    index=[4, 5, 6, 7])

In [22]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [23]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [24]:
pd.concat([df1, df2], axis = 0)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [25]:
pd.concat([df1, df2], axis = 1)

     A    B    C    D    A    B    C    D
0   A0   B0   C0   D0  NaN  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN  NaN
2   A2   B2   C2   D2  NaN  NaN  NaN  NaN
3   A3   B3   C3   D3  NaN  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN   A4   B4   C4   D4
5  NaN  NaN  NaN  NaN   A5   B5   C5   D5
6  NaN  NaN  NaN  NaN   A6   B6   C6   D6
7  NaN  NaN  NaN  NaN   A7   B7   C7   D7

In [26]:
df3 = pd.DataFrame({
    'E': ['E0', 'E1', 'E2', 'E3'],
    'F': ['F0', 'F1', 'F2', 'F3'],
    'G': ['G0', 'G1', 'G2', 'G3'],
    'H': ['H0', 'H1', 'H2', 'H3']},
    index=[0, 1, 2, 3])
df3

    E   F   G   H
0  E0  F0  G0  H0
1  E1  F1  G1  H1
2  E2  F2  G2  H2
3  E3  F3  G3  H3

In [29]:
pd.concat([df1, df3], axis = 1)

    A   B   C   D   E   F   G   H
0  A0  B0  C0  D0  E0  F0  G0  H0
1  A1  B1  C1  D1  E1  F1  G1  H1
2  A2  B2  C2  D2  E2  F2  G2  H2
3  A3  B3  C3  D3  E3  F3  G3  H3

## Merge

In [30]:
left = pd.DataFrame({
    'key': ['k0', 'k1', 'k2', 'k3'],
    'A'  : ['A0', 'A1', 'A2', 'A3'],
    'B'  : ['B0', 'B1', 'B2', 'B3']})

right = pd.DataFrame({
    'key': ['k0', 'k1', 'k2', 'k4'],
    'C'  : ['C0', 'C1', 'C2', 'C4'],
    'D'  : ['D0', 'D1', 'D2', 'D4']})

In [31]:
left

  key   A   B
0  k0  A0  B0
1  k1  A1  B1
2  k2  A2  B2
3  k3  A3  B3

In [32]:
right

  key   C   D
0  k0  C0  D0
1  k1  C1  D1
2  k2  C2  D2
3  k4  C4  D4

In [33]:
pd.merge(left, right, how = 'inner', on = 'key')

  key   A   B   C   D
0  k0  A0  B0  C0  D0
1  k1  A1  B1  C1  D1
2  k2  A2  B2  C2  D2

In [34]:
pd.merge(left, right, how = 'outer', on = 'key')

  key    A    B    C    D
0  k0   A0   B0   C0   D0
1  k1   A1   B1   C1   D1
2  k2   A2   B2   C2   D2
3  k3   A3   B3  NaN  NaN
4  k4  NaN  NaN   C4   D4

In [35]:
pd.merge(left, right, how = 'right', on = 'key')

  key    A    B   C   D
0  k0   A0   B0  C0  D0
1  k1   A1   B1  C1  D1
2  k2   A2   B2  C2  D2
3  k4  NaN  NaN  C4  D4

In [36]:
pd.merge(left, right, how = 'left', on = 'key')

  key   A   B    C    D
0  k0  A0  B0   C0   D0
1  k1  A1  B1   C1   D1
2  k2  A2  B2   C2   D2
3  k3  A3  B3  NaN  NaN

## Group by

In [37]:
data = {
    'Company': ['GOOG', 'GOOG','GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
    'Person' : ['Sam', 'Charlie', 'John', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
    'Sales'  : [200, 120, 236, 340, 124, 243, 350]
}

In [38]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    GOOG     John    236
3    MSFT      Amy    340
4    MSFT  Vanessa    124
5      FB     Carl    243
6      FB    Sarah    350

In [39]:
by_comp = df.groupby('Company')

In [40]:
by_comp

In [41]:
by_comp.mean()

              Sales
Company
FB       296.500000
GOOG     185.333333
MSFT     232.000000

In [42]:
by_comp.std()

              Sales
Company
FB        75.660426
GOOG      59.374518
MSFT     152.735065

In [43]:
by_comp.mean()

              Sales
Company
FB       296.500000
GOOG     185.333333
MSFT     232.000000

In [44]:
by_comp.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    236
MSFT     Vanessa    340

In [45]:
by_comp.count()

         Person  Sales
Company
FB            2      2
GOOG          3      3
MSFT          2      2

In [46]:
by_comp.describe()

        Sales
        count        mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.500000   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      3.0  185.333333   59.374518  120.0  160.00  200.0  218.00  236.0
MSFT      2.0  232.000000  152.735065  124.0  178.00  232.0  286.00  340.0

In [48]:
by_comp.describe().columns

MultiIndex([('Sales', 'count'),
            ('Sales',  'mean'),
            ('Sales',   'std'),
            ('Sales',   'min'),
            ('Sales',   '25%'),
            ('Sales',   '50%'),
            ('Sales',   '75%'),
            ('Sales',   'max')],
           )

In [51]:
by_comp.describe()['Sales']

         count        mean         std    min     25%    50%     75%    max
Company
FB         2.0  296.500000   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG       3.0  185.333333   59.374518  120.0  160.00  200.0  218.00  236.0
MSFT       2.0  232.000000  152.735065  124.0  178.00  232.0  286.00  340.0

In [52]:
by_comp.describe()['Sales']['max']

Company
FB      350.0
GOOG    236.0
MSFT    340.0
Name: max, dtype: float64

In [54]:
x = by_comp.describe()['Sales'][['max', 'min']]
x

           max    min
Company
FB       350.0  243.0
GOOG     236.0  120.0
MSFT     340.0  124.0

In [55]:
x['diffrence'] = x['max'] - x['min']
x

           max    min  diffrence
Company
FB       350.0  243.0      107.0
GOOG     236.0  120.0      116.0
MSFT     340.0  124.0      216.0